.config/doom/config.org
#+TITLE: Doom Emacs Configuration File
#+DESCRIPTION: Doom Emacs Configuration
#+AUTHOR: Dean Smith
#+DATE: Sat Mar 15 2025
#+PROPERTY: header-args :tangle config.el

** Beacon

#+BEGIN_SRC emacs-lisp
(beacon-mode 1)
#+END_SRC

** Directories

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org/")
#+END_SRC

** Dired Configuration

*** Keybindings

#+BEGIN_SRC emacs-lisp
(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "Z") 'dired-do-compress
  (kbd "+") 'dired-create-directory
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)
#+END_SRC

*** Dired Extensions Handling

#+BEGIN_SRC  emacs-lisp
(setq dired-open-extensions '(("gif" . "gimp")
                              ("jpg" . "gimp")
                              ("png" . "gimp")
                              ("mkv" . "vlc")
                              ("mp4" . "vlc")))
#+END_SRC

*** Dired Peep Mode Keybindings

#+BEGIN_SRC emacs-lisp
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC

*** Dired Move Deleted Files To Trash

#+BEGIN_SRC emacs-lisp
(setq delete-by-moving-to-trash t
      trash-directory "~/.local/share/Trash/files/")
#+END_SRC

** Emojis

#+BEGIN_SRC emacs-lisp
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+END_SRC

** Line Numbers

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type t)
#+END_SRC

** Modeline

#+BEGIN_SRC emacs-lisp
(set-face-attribute 'mode-line nil :font "EnvyCodeR Nerd Font 13")
(setq doom-modeline-height 30     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-persp-icon t) ;; adds folder icon next to persp name
#+END_SRC

** Perspective

#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Switch to perspective NAME"       "DEL" #'persp-switch
      :desc "Switch to buffer in perspective"  "," #'persp-switch-to-buffer
      :desc "Switch to next perspective"       "]" #'persp-next
      :desc "Switch to previous perspective"   "[" #'persp-prev
      :desc "Add a buffer current perspective" "+" #'persp-add-buffer
      :desc "Remove perspective by name"       "-" #'persp-remove-by-name)
#+END_SRC

** Theme

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-tomorrow-night)
#+END_SRC
